import '../presentation/models/ProductModel.dart';

var initialProducts = [
  ProductModel(
      0,
      "Наушники беспроводные JB L700 накладные",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Накладные\n"
          "Шумоподавление: Активное\n"
          "Мин. частота, Гц: 20",
      "https://ir.ozone.ru/s3/multimedia-1-r/wc1000/7129604475.jpg",
      6999,
      false

  ),
  ProductModel(
      1,
      "Наушники беспроводные JB L510 накладные",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Накладные\n"
          "Шумоподавление: Активное\n"
          "Время работы в режиме разговора, ч: 5",
      "https://ir.ozone.ru/s3/multimedia-1-3/wc1000/7129908039.jpg",
      6799,
      true
  ),
  ProductModel(
      2,
      "Наушники накладные Edifier W800BT Plus белый беспроводные bluetooth",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Накладные\n"
          "Шумоподавление: Нет\n"
          "Время работы в режиме разговора, ч: 55",
      "https://ir-4.ozone.ru/s3/multimedia-h/wc1000/6782456609.jpg",
      5599,
      false
  ),
  ProductModel(
      3,
      "Беспроводные наушники Xiaomi Haylou X1 c двойным шумоподавлением, черные",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Вкладыши\n"
          "Шумоподавление: Активное\n"
          "Время работы в режиме разговора, ч: 8",
      "https://ir.ozone.ru/s3/multimedia-d/wc1000/6701030797.jpg",
      3799,
      false
  ),
  ProductModel(
      4,
      "Беспроводные True Wireless наушники Huawei Freebuds SE 2, с микрофоном, белые",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Вкладыши\n"
          "Шумоподавление: Активное\n"
          "Время работы в режиме разговора, ч: 5",
      "https://ir.ozone.ru/s3/multimedia-z/wc1000/6777834503.jpg",
      4199,
      false
  ),
  ProductModel(
      5,
      "Беспроводные True Wireless внутриканальные наушники Huawei Freebuds 5i с микрофоном, с шумоподавлением, чёрные",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Внутриканальные\n"
          "Шумоподавление: Активное\n"
          "Макс. частота, Гц: 20000",
      "https://ir.ozone.ru/s3/multimedia-1-a/wc1000/6955572670.jpg",
      4199,
      false
  ),
  ProductModel(
      6,
      "Беспроводные внутриканальные наушники Huawei FreeBuds 5 с микрофоном, с шумоподавлением, серебристые",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Вкладыши\n"
          "Шумоподавление: Активное\n"
          "Мин. частота, Гц: 16.0",
      "https://ir.ozone.ru/s3/multimedia-1-m/wc1000/6955572682.jpg",
      3899,
      false
  ),
  ProductModel(
      7,
      "realme Наушники беспроводные с микрофоном realme Buds T110, Bluetooth, USB Type-C, зеленый",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Внутриканальные\n"
          "Шумоподавление: Активное\n"
          "Время работы в режиме разговора, ч: 7",
      "https://ir.ozone.ru/s3/multimedia-1-m/wc1000/7033726558.jpg",
      4499,
      false
  ),
  ProductModel(
      8,
      "Наушники игровые с микрофоном для компьютера - Наушники проводные для пк black",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Полноразмерные\n"
          "Шумоподавление: Активное\n"
          "Мин. частота, Гц: 20.0",
      "https://ir.ozone.ru/s3/multimedia-1-8/wc1000/7131229280.jpg",
      6499,
      false
  ),
  ProductModel(
      9,
      "Беспроводные накладные наушники HUAWEI FreeClip с микрофоном, с шумоподавлением, фиолетовые",
      "Наличие микрофона: Да\n"
          "Конструкция наушников: Накладные\n"
          "Шумоподавление: Активное\n"
          "Время работы в режиме разговора, ч: 8",
      "https://ir.ozone.ru/s3/multimedia-9/wc1000/6894953241.jpg",
      4399,
      false
  ),
];
